РазработкаОУМобильная/src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>ПлатежнаяСистема</name>
    <comment>PaymentSystem</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>ККМOffline</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПрограммнаяФискализация</name>
    <comment>SoftwareFiscalization</comment>
  </enumValues>
  <enumValues>
    <name>УстройствоВвода</name>
    <comment>InputDevice</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
</mdclass:Enum>

РазработкаОУМобильная/src/Catalogs/ДрайверыОборудования/ДрайверыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДрайверыОборудования</name>
  <predefined>
    <items>
      <name>Драйвер1СЭмуляторПлатежнойСистемы</name>
      <description>1C:Эмулятор платежной системы</description>
    </items>
    <items>
      <name>Драйвер1СДрайверFPrint11</name>
      <description>1С:Драйвер FPrint-11</description>
    </items>
    <items>
      <name>Драйвер1СПринтерЧеков</name>
      <description>1С:Принтер чеков</description>
    </items>
    <items>
      <name>Драйвер1СУстройствоВвода</name>
      <description>1С:Устройство ввода</description>
    </items>
    <items>
      <name>ДрайверАТОЛККТ</name>
      <description>АТОЛ:Драйвер ККТ</description>
    </items>
    <items>
      <name>ДрайверInpasПлатежнаяСистема</name>
      <description>ИНПАС:Эквайринг-терминал</description>
    </items>
    <items>
      <name>ДрайверСканкодСканерШтрихкодаChipherlab</name>
      <description>СКАНКОД:Cканер штрихкода Chipherlab</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановкаИзМакета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

РазработкаОУМобильная/src/CommonModules/МенеджерОборудованияВызовСервераПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Обновить поставляемые драйверы в составе конфигурации
//                                   
Процедура ОбновитьПоставляемыеДрайвера() Экспорт
	
	// Фискальные регистраторы
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор,
		"Драйвер1СДрайверFPrint11", 
		"1С:Драйвер FPrint-11",
		"com.e1c.driverforatolkkm",
		"2.0.7.1");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор,
		"ДрайверАТОЛККТ", 
		"АТОЛ:Драйвер ККТ",
		"com.atol.drivers.fptr1c",
		"9.7.0.4549");
	// Конец Фискальные регистраторы
	
	// Принтеры чеков
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков,
		"Драйвер1СПринтерЧеков", 
		"1С:Принтер чеков",
		"com.e1c.driverformobileprinter",
		"2.0.5.1");
	// Конец принтеров чеков
	
	// Устройство ввода
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"Драйвер1СУстройствоВвода", 
		"1С:Устройство ввода",
		"com.e1c.inputdevice",
		"1.0.1.2");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверСканкодСканерШтрихкодаChipherlab", 
		"СКАНКОД:Сканер штрихкода Chipherlab",
		"com.e1c.scancodescanner",
		"1.0.1.8");
	// Конец устройство ввода

	// Платежные cистемы
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"ДрайверInpasПлатежнаяСистема", 
		"ИНПАС:Эквайринг-терминал",
		"com.inpas.dualconnector1c",
		"1.5");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"Драйвер1СЭмуляторПлатежнойСистемы", 
		"1С:Эмулятор платежной системы",
		"com.e1c.paymentsystememulator",
		"1.0.1.2");
		
	// Конец Платежные cистемы.
	
КонецПроцедуры

// Обновление библиотеки в составе конфигурации.
//                                   
Процедура ОбновлениеБиблиотеки() Экспорт
	
	ОбновитьПоставляемыеДрайвера();
	
КонецПроцедуры

// Возвращает флаг возможности добавления новых драйверов в справочник драйверов
//
Функция ВозможностьДобавленияНовыхДрайверов() Экспорт
	
	МожноДобавлятьНовыеДрайвера = Истина;
	Возврат МожноДобавлятьНовыеДрайвера;
	
КонецФункции

// Возвращает список доступных типов оборудования.
//
Функция ПолучитьДоступныеТипыОборудования() Экспорт
	
	СписокОборудования = Новый Массив;
	
	// Принтер чеков
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков);
	// Конец принтер чеков.
	
	// Фискальные регистраторы
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор);
	// Конец Фискальные регистраторы.
	
	// Устройство ввод
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода);
	// Конец Устройство ввод.
		
	// Платежные cистемы
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема);
	// Конец Платежные cистемы.

	Возврат СписокОборудования;
	
КонецФункции

#КонецОбласти
